Books_And_Tutorials/Win_and_Linux/linux_vs_windows_sync_obj.org
#+begin_html
<link rel="stylesheet" href="../../css/org-style.css" type="text/css"/>
<div id="postamble">
<p class="author"> Author: Pralay Patoria
<a href="mailto:ppatoria@gmail.com">&lt;ppatoria@gmail.com&gt;</a>
</p>
<p class="date"> Date: 24-12-2013</p>
</div>
#+end_html
#+OPTIONS: date:nil, creator:nil, author:nil
#+title: Synchronization objects in windows and linux.
* UNIX environments use several techniques in the Pthreads implementation to achieve synchronization. They are: 
** Mutexes 
** Condition variables 
** Semaphores 
** Interlocked exchange
 
* Similarly, the synchronization techniques available in the Windows environment are: 
** Spinlocks 
** Events 
** Critical sections 
** Semaphores 
** Mutexes 
** Interlocked exchange
