Books_And_Tutorials/Win_and_Linux/linux_vs_windows_sync_obj.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"
lang="en" xml:lang="en">
<head>
<title>Synchronization objects in windows and linux.</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2013-12-26 13:05:56 "/>
<meta name="author" content=""/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
</head>
<body>
<div id="content">

<h1 class="title">Synchronization objects in windows and linux.</h1>


<link rel="stylesheet" href="../../css/org-style.css" type="text/css"/>
<div id="postamble">
<p class="author"> Author: Pralay Patoria
<a href="mailto:ppatoria@gmail.com">&lt;ppatoria@gmail.com&gt;</a>
</p>
<p class="date"> Date: 24-12-2013</p>
</div>

<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 UNIX environments use several techniques in the Pthreads implementation to achieve synchronization. They are: </a>
<ul>
<li><a href="#sec-1_1">1.1 Mutexes </a></li>
<li><a href="#sec-1_2">1.2 Condition variables </a></li>
<li><a href="#sec-1_3">1.3 Semaphores </a></li>
<li><a href="#sec-1_4">1.4 Interlocked exchange </a></li>
</ul>
</li>
<li><a href="#sec-2">2 Similarly, the synchronization techniques available in the Windows environment are: </a>
<ul>
<li><a href="#sec-2_1">2.1 Spinlocks </a></li>
<li><a href="#sec-2_2">2.2 Events </a></li>
<li><a href="#sec-2_3">2.3 Critical sections </a></li>
<li><a href="#sec-2_4">2.4 Semaphores </a></li>
<li><a href="#sec-2_5">2.5 Mutexes </a></li>
<li><a href="#sec-2_6">2.6 Interlocked exchange </a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> UNIX environments use several techniques in the Pthreads implementation to achieve synchronization. They are: </h2>
<div class="outline-text-2" id="text-1">


</div>

<div id="outline-container-1_1" class="outline-3">
<h3 id="sec-1_1"><span class="section-number-3">1.1</span> Mutexes </h3>
<div class="outline-text-3" id="text-1_1">

</div>

</div>

<div id="outline-container-1_2" class="outline-3">
<h3 id="sec-1_2"><span class="section-number-3">1.2</span> Condition variables </h3>
<div class="outline-text-3" id="text-1_2">

</div>

</div>

<div id="outline-container-1_3" class="outline-3">
<h3 id="sec-1_3"><span class="section-number-3">1.3</span> Semaphores </h3>
<div class="outline-text-3" id="text-1_3">

</div>

</div>

<div id="outline-container-1_4" class="outline-3">
<h3 id="sec-1_4"><span class="section-number-3">1.4</span> Interlocked exchange </h3>
<div class="outline-text-3" id="text-1_4">


</div>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Similarly, the synchronization techniques available in the Windows environment are: </h2>
<div class="outline-text-2" id="text-2">


</div>

<div id="outline-container-2_1" class="outline-3">
<h3 id="sec-2_1"><span class="section-number-3">2.1</span> Spinlocks </h3>
<div class="outline-text-3" id="text-2_1">

</div>

</div>

<div id="outline-container-2_2" class="outline-3">
<h3 id="sec-2_2"><span class="section-number-3">2.2</span> Events </h3>
<div class="outline-text-3" id="text-2_2">

</div>

</div>

<div id="outline-container-2_3" class="outline-3">
<h3 id="sec-2_3"><span class="section-number-3">2.3</span> Critical sections </h3>
<div class="outline-text-3" id="text-2_3">

</div>

</div>

<div id="outline-container-2_4" class="outline-3">
<h3 id="sec-2_4"><span class="section-number-3">2.4</span> Semaphores </h3>
<div class="outline-text-3" id="text-2_4">

</div>

</div>

<div id="outline-container-2_5" class="outline-3">
<h3 id="sec-2_5"><span class="section-number-3">2.5</span> Mutexes </h3>
<div class="outline-text-3" id="text-2_5">

</div>

</div>

<div id="outline-container-2_6" class="outline-3">
<h3 id="sec-2_6"><span class="section-number-3">2.6</span> Interlocked exchange </h3>
<div class="outline-text-3" id="text-2_6">

</div>
</div>
</div>
<div id="postamble">
<p class="date"> Date: 2013-12-26 13:05:56 </p>
</div>
</div>
</body>
</html>
